app/views/businesses/show.html.haml

      %header
        %h3 User Reviews ("#{@business.reviews.count}")
      %ul
        - @business.reload.reviews.each do |review|
---
SELECT COUNT(*) FROM "reviews"  WHERE "reviews"."business_id" = $1  [["business_id", 2]]
SELECT "reviews".* FROM "reviews"  WHERE "reviews"."business_id" = $1  [["business_id", 2]]