app/views/users/show.html.haml

SELECT COUNT(*) FROM "reviews"  WHERE "reviews"."user_id" = $1  [["user_id", 1]]
SELECT "reviews".* FROM "reviews"  WHERE "reviews"."user_id" = $1  [["user_id", 1]]
---
      %header
        %h3 #{@user.full_name}'s Reviews (#{@user.reviews.count})
      %ul
        - @user.reviews.each do |review|