app/controllers/businesses_controller.rb

SELECT "businesses".* FROM "businesses"
---
  def index
    @businesses = Business.all

SELECT  "businesses".* FROM "businesses"  WHERE "businesses"."id" = $1 LIMIT 1  [["id", 1]]
---
  def show
    @business = Business.find(params[:id])

INSERT INTO "businesses" ("created_at", "description", "image_url", "name", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", "2016-01-09 08:20:33.371981"], ["description", "Another coffee shop"], ["image_url", "/tmp/starbucks.jpg"], ["name", "Coffee Bean"], ["updated_at", "2016-01-09 08:20:33.371981"]]
---
  def create
    @business = Business.new(business_params)

    if @business.save