app/controllers/reviews_controller.rb

  def create
    @business = Business.find_by(id: params[:business_id])
    @review = @business.reviews.new(params.require(:review).permit(:content))
    @review.user = current_user

    if @review.save
---
SELECT  "businesses".* FROM "businesses"  WHERE "businesses"."id" = 2 LIMIT 1
INSERT INTO "reviews" ("business_id", "content", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["business_id", 3], ["content", "Yum!"], ["created_at", "2016-01-12 01:12:23.769532"], ["updated_at", "2016-01-12 01:12:23.769532"], ["user_id", 1]]